## Введение
При современном темпе жизни все более актуальным становится вопрос отдыха, в качестве которого многие обращаются к настольным играм. В частности, речь идет о настольных ролевых играх, суть которых состоит в отыгрыше своего персонажа, исследованию вымышленного мира и участии в приключениях, под руководством ведущего. Такое времяпрепровождение является привлекательным в силу большой свободы и небольших денежных затрат (со стороны игроков зачастую равных одиноразовому вложению в набор кубов и нескольких листов А4, содержащих информацию о персонаже). 

Однако существуют и трудности. Так, при игре с использованием карты возникает проблема нехватки материалов для ее использования: проблемы с наличием или транспортировкой ватмана или отсутствие миниатюр персонажей, на которые требуется тратить силы и материальные средства. Зачастую используемая карта показывает лишь сетку для передвижения, из-за чего могут возникнуть проблемы с описанием местности (_не самая корректная формулировка_). 

Таким образом, проблема использования физической карты актуальна для игроков в настольные ролевые игры. Целью данной курсовой работы является создание мобильного приложения, предоставляющего всем участником игровой сессии доступ к интерактивной карте, отслеживающей передвижение персонажей и дающего лучшее представление о текущей местности.

___
> Переход получается слишком резкий, возможно, сначала есть смысл рассказать об играх такого плана в целом.

## Dungeons and Dragons
Dungeons and Dragons, впервые вышедшая в 1974 году, является настольной ролевой игрой в жанре фэнтези, в которой группа игроков под руководством ведущего (сокр. ДМ - от английского Dungeon Master) должна проходить по заранее придуманному игровому сценарию, порой имеющему нелинейную структуру. Основные правила определяются Книгой Игрока (Player's Handbook), врагов можно брать из Энциклопедии Чудовищ (Monster Manual), однако классы, расы, экипировку и т.д. с различными характеристиками ДМ может придумать самостоятельно. Иначе говоря, DnD не привязана к конкретному вымышленному миру, а является системой для создания приключений в разных мирах. 

### История
Непосредственным предшественником Dungeons and Dragons приянто считать разработанную в 1971 году Гэри Гайгэксом и Джеффом Перреном игру Chainmail - варгейм (от англ. «wargame» — рус. «военная игра»; настольная или компьютерная стратегическая игра, имитирующая военные конфликты), события которго происходят в Средневековье. Она была примечательна тем, что имела фэнтези-дополнение к правилам, описывающее использование магии, монстром и зачарованной экипировки. 

Это привлекло внимание Дэйва Арнесона, который решил адаптировать правила под свой фэнтези-мир Blackmoor. Основная идея теперь заключалась в том, что каждый из игроков контролирует определенного персонажа. Вся группа из сессии в сессию исследует подземелия, преодолевая различные препятствия и повышая характеристики. 

Осенью 1972 года Арнесон показал свои наработки Гайгэксу, и в 1974 году совместными усилиями в свет вышла Dungeons and Dragons, содержащая всего три класса (_fighting-man_ - воин, _magic-user_ - маг и клирик), четыре расы (человек, гном, эльф и хоббит), несколько видов врагов и три мировоззрения (_lawful_ - законопослушный, _neutral_ - нейтральный и _chaotic_ - хаотичный). Однако в последующие два года вышло четыре официальных дополнения, существенно расширявших правила добавлением новых классов, заклинаний и игровых механик.  

#### Первая редакция
Advanced Dungeons and Dragons, также называемая первой редакцией Dungeons and Dragons, выпускалась между 1977 и 1979 и содержала в себе правила как из оригинальной игры и дополнений, так и из журналов. Количество мировоззрений увеличилось в три раза: комбинации из прошлой оси и новой (_good_ - добрый, _neutral_ - нейтральный и _evil_ - злой).

В последующие шесть лет вышло пять дополнений, в основном содержащие уже существующие правила, ранее публиковавшиеся только в журналах.

#### Вторая редакция
В 1989 году вышла вторая редакция, расширяющая правила, в том числе добавляя также ранее присутствовавшие только в журналах. Так, например, была переработана система урона, измерения растояния; добавлена возможность критических ударов, навыки стали официально поддерживаемой игровой механикой, а не опцией. Была несколько переработана система классов: добавлены наборы для каждого класса, использующие уже имеющиеся у класса способности и черты для создания нового, порой накладывающие ограничения на базовый. 

Также разработчики постарались избавиться от негативных отсылок, заменив дьяволов и демонов на Baatezu и Tanar'ri, и избавившись от класса Assassin (наемник). В целом был сделан упор на героическую составляющую и комнадную работу. Возраст целевой аудитории был снижен до подростков.

#### Третья редакция
В 1997 году компания Wizard of the Coast купила ранее выпускавшую Dungeons and Dragons TSR и в 2000 в свет вышло третье издание, представившее систему, базирующуюся на двадцатигранном кубе (также называемым d20). 

Суть системы заключалась в следующем: почти все действия решаются с помощью куба d20, к результату броска которого прибавляется определенный модификатор, зависящий от значения соответствующей характеристики.

Также, в третьем издании переработали передвижение: теперь карта представляет из себя сетку, что упрощает использование миниатюр и делает больший упор на тактику.

Добавленные во второй редакции наборы были убраны, но добавленны соответствующие самостоятельные классы. В систему классов также добавилось понятие черт, позволяющий добавить персонажу определенные особенности. Появилось понятие престижного класса - класса, на который игрок мог поменять свой, если его персонаж проходил по определенным требованиям.

В 2003 году вышла редакция 3.5, вносящая изменения баланса в игру, а также добавившая и убравшая некоторые заклинания.

#### Четвертая редакция
С 2008 по 2010 году выходила четвертая редакция, по традиции представившая новые классы: чернокнижника (warlock) и военачальника (warlord). Старым классам изменили умения так, чтобы у всех было их одинаковое количество на разные типы (такие как определенное количество за бой или за день). 

Другое коснувшееся классов изменение: престижные классы были заменены на специальности для каждого, выбор которых становится возможен по достижению одинннадцатого уровня.

Была добавлена механика короткого и длительного отдыха, позволяющая восстановить заклинания и полностью исцелиться.

#### Пятая редакция
Вышедшая в 2014 году пятая редакция на данный момент является последней. Многие правила упростили: например, защита теперь определяется только классом брони (АС), иногда с необходимостью делать спасброски (saving throws), для которых игрок бросает d20 и прибавляет полученное значение к названному ДМ'ом модификатору - для уклонения от негативного эффекта число должно превышать определенное значение. 

> Тут вообще можно написать миллион вещей. Возможно, их лучше оставить, чтобы добить требование по объему ¯\\\_(ツ)\_/¯

### Правила
Описанные ниже правила применимы больше для пятой редакции, т.к. на данный момент она является последней и самой популярной (_источник?_). 
 
 > После подробного расписывания предыдущей части, я поняла, что эту надо будет основательно переделать.
 
#### Игровой процесс
Большую часть игрового процесса занимает устное общение между игроками и ведущим - ДМ'ом, последний из которых проводит игроков по сюжету, описывает мир и окружение, дает ответную реакцию на действия игроков и отыгрывает неигровых персонажей (в том числе врагов). Совершая определенные действия, игроки кидают кубики, после чего ДМ оценивает степень успешности выполнения действия.

#### Игровой инвентарь
Для игры требуется набор кубов (четыре, шесть, восемь, двенадцать, двадцать граней и два десятигранных), листы персонажей, карта и миниатюры (фигурки персонажей). Иногда последние два пункта опускают, и передвижение игроков вместе с боями описываются полностью в устной форме. 

#### Создание персонажа
Игроки заранее создают персонажей, выбирая класс и расу из возможных, определяя их характеристики (сила, телосложение, ловкость, интеллект, мудрость и харизма) броском кубика или выбирая из списка значений. Из этих характеристик вычисляется модификатор. Далее игроки выбирают навыки, а также соответствующие своему классу умения, определяются с экипировкой и начальными предметами. В конце игроку необходимо прописать своему персонажу биографию, после согласовав ее с ДМ'ом.

По ходу игры персонажи смогут повышать свой уровень, изучая новые умения и улучшая характеристики.

#### Бой
_TODO_

___
## Анализ конкурентов
> Стоит сказать, что для обоснования выбранного функционала следует провести опрос (чтобы выглядело солиднее). То, что есть сейчас - результат опыта небольшого количества играющий людей.

Аналогов разрабатываемого приложения на телефоны нет, но есть приложения для ПК, содержащие в себе требуемые функции. Однако присутствуют и излишние, т.к. данные приложения создавались для игры по сети, в то время как DnD Map - для помощи при проведении оффлайн-сессий. 

### Roll20 и Tabletop Simulator
__Roll20__ - сайт, позволяющий играть в настольные ролевые игры по разным системам (в том числе Dungeons and Dragons) через интернет.
__Tabletop Simulator__ - приложение для ПК, представляющее собой виртуальный стол для игры в настольные игры по сети. Наряду с Roll20 является популярным выбором для проведения онлайн-сессий Dungeons and Dragons.

Несмотря на то, что это два разных не связанных друг с другом приложения, их функционал мало чем различается, поэтому проще рассматривать их совместно.

Функционал, который можно включить в приложение DnD Map:
- __Интерактивная, настраиваемая вручную карта__ (возможность задать фон, размер клеток, затемненные участки). У каждого присутствующего на ней персонажа можно настроить аватар. На карте также можно указать траекторию движения, посчитать расстрояние до другой клетки. 
- __Отображение здоровья, скорости врагов__.  

Функционал, не подходящий для DnD Map:
- __Рисование на карте__ - на небольшом экране рисование проблематично.
- __Профиль, представляющий собой интерактивный лист персонажа__ - переключение между профилем и картой будет отнимать много времени. К тому же наличие листов персонажей накладывает ограничения в используемой системе (в т.ч. в редакциях), что помешает будущему масштабированию приложения.
- __Броски кубиков__ - (_согласно опросу_) людям приятнее делать это вживую.
- __Чат__ - при игре люди сидят рядом, быстрее и проще будет сказать что-то вслух.
- __Бибилиотека НПС / врагов, позволяющая тратить меньше времени на прописывание неигровых персонажей__ - информации о неигровых персонажах в самом приложении будет немного (см. пункт про профили персонажей).
- __Воспроизведение музыки для разных игровых ситуаций__ - переключение между этой функцией и картой будет занимать много времени, быстрее и удобнее это делать с компьютера (_момент спорный, стоит включить в опрос_).

## Используемые технологии
Для написания мобильного приложения используется язык программирования Kotlin, выбор в пользу которого вместо языка Java был сделан вследствие более быстрой разработки (написания кода).

Для макетирования дизайна использован онлайн-сервис Figma.

Передача данных между устройствами будет реализована через локальную беспроводную сеть без выхода в интернет, созданной с помощью метода `android.net.wifi.WiFiManager.startLocalOnlyHotspot(WifiManager.LocalOnlyHotspotCallback callback, Handler handler)`
